Revit 2027 API
IFCLegacyStairOrRamp.GetLandingGeometries Method
 Gets the geometries of landings.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IList<GeometryObject>> GetLandingGeometries()
Public Function GetLandingGeometries As IList(Of IList(Of GeometryObject))
public:
IList<IList<GeometryObject^>^>^ GetLandingGeometries()
member GetLandingGeometries : unit -> IList<IList<GeometryObject>>
Return Value
IList<IList<GeometryObject>>
 The geometries of landings.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace